[bits 64] ; показуєм програмі шо ассемблер працює для 64-ти бітного процессора
extern ExitProcess ; імпорт бібліотеки kernel32.dll

section .data ; Створення змінних
    my_number dq 100 ; змінна з значенням 100 і назвою my_number; dq - define - визначити
    nun_2 dq 50 ; змінна з значенням 50 і назвою num_2; dq - define - визначити

section .text ; Створення логіки хуйні, ну проги блять 
    global _start   ; оголошення точки входу для лінкера, щоб він розумів де починати програму

_start:     ; початок виконання програми
    sub rsp, 40 ; Виділення 40б пам'яті

    mov rax, 100   ; запис значення 100 в регістр rax
    mov rbx, 50    ; запис значення 50 в регістр rbx

    push rax    ; запис значення регістру rax(100) в стек, тобто поверх пам'яті регістру і через це можна працювати з регістром і значення 100 залишиться нетронутим ;в стеку: [100]
    push rbx    ; запис значення регістру rbx(50) в стек, тобто поверх пам'яті регістру і через це можна працювати з регістром і значення 50 залишиться нетронутим ; в стеку: [50, 100]

    pop rax     ; записує верхнє значення(50) стеку в регістр rax, бо воно записало значення в вигляді: [50, 
                ;                                                                                       100]
    pop rbx     ; записує нижнє значення(100) стеку в регістр rbx

    mov rcx, rax       ; запис значення регістру rax в rcx(регістр виходу)
    call ExitProcess   ; виклик про завершення програми