[bits 64] ; показуємо програму, що вона працює для 64-ти бітного процессора

extern ExitProcess ; підключення бібліотеки kernel32.dll

section .text ; Створення логіки програми
    global _start ; показує лінкеру де повинна починатись программа

_start:     ; початок програми
    sub rsp, 40 ; виділення 40б пам'яті для того, щоб бібліотека kernel32.dll коректно спрацювала

    mov rax, 100    ; занесення значення 100 в регістр rax
    mov rbx, 100    ; занесення значення 100 в регістр rbx

    cmp rax, rbx    ; порівння регістрів rax i rbx 
    je equal ; je / jne / jg (Jump if Equal / Not Equal / Greater); тут порівнняня на рівність занченнь

    ; якщо значення НЕ рівні, то вионується ця частина коду:

    mov rcx, 0  ; занесення значення 0 в регістр виходу rcx, якщо значення НЕ рівні
    jmp finish  ; "стрибок" на частину коду яка записана в "finish: "
equal:  ; далі код працює, якщо числа рівні
    mov rcx, 1  ; запис 1 в регістр виходу rcx, якщо значення рівні
finish: ; кінец куди стрибає программа, якщо значення НЕ рівні
    call ExitProcess ; виклик фунції ExitProcess з бібліотеки kernel32.dll, про закриття процесу і повідомляє вінді, що процесс завершився 